// Функция работает аналогично встроенному методу массива "filter". Принимает два аргумента:
// - Массив, который нужно отфильтровать.
// - Колбэк-функцию, которая определяет условие фильтрации. Эта функция должна вызываться для каждого элемента массива и возвращать "true", если элемент должен остаться в результирующем массиве, или "false", если нет.
//Результат фильтрации возвращается в виде нового массива.

const numbers = [1, 2, 3, 4, 5, 6];

function myFilter(array, callback) {
    let newArray = [];
    for (let i = 0; i < array.length; i++) {
        if (callback(array[i])) {    //каждый элемент переданного массива передается в качестве аргумента в переданную функцию
            newArray.push(array[i])  //если true, элемент пушится в новый массив
        }
    }

    return newArray;
}


let a = myFilter(numbers, (num => num % 2 === 0));
let b = myFilter(numbers, (num => num % 3 === 0));
